<a href="https://colab.research.google.com/github/a-forty-two/DFE3/blob/main/03_Python_Pandas_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd
import datetime

## DataFrames

In [3]:
students = ['Alice', 'Bob', 'Emily', 'Charlie']

In [4]:
scores = [90, 80, 65, 50]

In [5]:
exam_results = pd.DataFrame(
    {
        "name": students,
        "scores": scores
    }
)

In [6]:
exam_results

      name  scores
0    Alice      90
1      Bob      80
2    Emily      65
3  Charlie      50

### Searching (SQL SELECT)

In [ ]:
exam_results.loc[0, 'scores'] # location-> rowid, column_NAME(s)

In [ ]:
exam_results.loc[:, 'scores']

In [ ]:
exam_results.loc[2, :]

In [ ]:
exam_results['scores']

In [7]:
exam_results[['name', 'scores']]
# on DataFrame->  filtering happens on COLUMN LEVEL

      name  scores
0    Alice      90
1      Bob      80
2    Emily      65
3  Charlie      50

### Add Columns

We can also easily add columns

In [8]:
gender = ['female', 'male', 'female', 'male']

In [9]:
exam_results['gender'] = gender
# Creates a new dataframe with a new column called Gender

In [10]:
exam_results

      name  scores  gender
0    Alice      90  female
1      Bob      80    male
2    Emily      65  female
3  Charlie      50    male

In [ ]:
exam_results['scores']

### Remove Columns

In [11]:
exam_results.drop('name', axis=1)
# axis=1 means column wise
# axis=0 means row wise 
# 0 means index (flows through rows), 1 is for [column_names]

   scores  gender
0      90  female
1      80    male
2      65  female
3      50    male

### Column names and Row Index

In [12]:
exam_results.columns
#axis=1

Index(['name', 'scores', 'gender'], dtype='object')

In [13]:
exam_results.index
#axis=0

RangeIndex(start=0, stop=4, step=1)

### Renaming Columns

In [ ]:
exam_results.rename({'name': 'first_name'}, axis=1)

### Dealing with missing values

Dataframes have specific commands which help with the handling of missing data

In [14]:
sparse = pd.DataFrame({'a': [1, 2, 3],
                       'b': [np.nan, 4, np.nan],
                       'c': [5, np.nan, np.nan]})

In [15]:
sparse

   a    b    c
0  1  NaN  5.0
1  2  4.0  NaN
2  3  NaN  NaN

In [16]:
sparse.isna()

       a      b      c
0  False   True  False
1  False  False   True
2  False   True   True

In [17]:
sparse.fillna(0) # fill those null values with 0

   a    b    c
0  1  0.0  5.0
1  2  4.0  0.0
2  3  0.0  0.0

In [18]:
sparse.dropna(axis=1) # axis=1 means column level dropping

   a
0  1
1  2
2  3

In [22]:
sparse = pd.DataFrame({'a': [1, 2, 3],
                       'b': [np.nan, 4, np.nan],
                       'c': [5, np.nan, np.nan]})
sparse.fillna(0)
sparse.dropna() # axis=0-> row wise!
# everything dropped-> each row contained at least 1 null value!

Empty DataFrame
Columns: [a, b, c]
Index: []

### Group by

In [23]:
exam_results.groupby('gender').mean()
# SQL made a lot easier!
# Select mean(*) from exam_results group by gender

        scores
gender
female    77.5
male      65.0

In [ ]:
mylist = [1,2,1,2]

exam_results.groupby(mylist).get_group(1)

In [ ]:
exam_results.groupby(mylist).get_group(2)

Thus, suppose we want to group people who obtained marks above or below 70, then we could do:

In [ ]:
above_70 = exam_results['scores'] > 70
above_70

This will compute the mean scores of students who scored above or below 70

In [ ]:
exam_results.groupby(above_70).mean()

### Merge and Joining

In [24]:
contacts = pd.DataFrame(
    {
        'name' : ['Alice', 'Charlie'],
        'tel'  : ['+44 1234 5678', '+44 3245 5564']
    }
)

In [25]:
exam_results.merge(contacts, left_on='name', right_on='name')   
# defaults to inner join
# inner join-> Set INTERSECTION

      name  scores  gender            tel
0    Alice      90  female  +44 1234 5678
1  Charlie      50    male  +44 3245 5564

In [26]:
exam_results.merge(contacts, left_on='name', right_on='name', how='outer')
# Null values for Bob and Emily because on outer join, no data present!
# outer join-> Set Union

      name  scores  gender            tel
0    Alice      90  female  +44 1234 5678
1      Bob      80    male            NaN
2    Emily      65  female            NaN
3  Charlie      50    male  +44 3245 5564